# **01. Import Module**

In [2]:
import pandas as pd

# **02. Import File**

In [3]:
#Excel (.xlsx)
data = pd.read_excel("Nilai Kelas.xlsx")
data

      Name  Mth  Phy   Chm  Bio
0     Andi   86   62  43.0   23
1  Bambang   56   75  53.0   85
2   Candra    4   75  42.0   21
3     Dido   24   52  12.0   52
4     Dido   74   24  74.0   32
5     Erik   23   64   NaN   31
6      NaN   34   45  52.0   14
7    Gandi   70   70  70.0   70
8    Gandi   70   70  70.0   70

In [4]:
#Comma sapparated value (csv)
data = pd.read_csv("Nilai Kelas.csv", sep=";")
data

      Name  Mth  Phy   Chm  Bio
0     Andi   86   62  43.0   23
1  Bambang   56   75  53.0   85
2   Candra    4   75  42.0   21
3     Dido   24   52  12.0   52
4     Dido   74   24  74.0   32
5     Erik   23   64   NaN   31
6      NaN   34   45  52.0   14
7    Gandi   70   70  70.0   70

# **03. Create New Data**

In [ ]:
#Data Frame from Dictionary
dicData = {
    'Cars': ["Andi", "Bambang", "Candra","Dido"],
    'Mth': [86, 56,  4, 24],
    'Phy': [62, 75, 72, 52]
}
newData = pd.DataFrame(dicData)
newData

In [ ]:
#Create Series
val = [86, 56,  4, 24]
mth = pd.Series(val)
mth

In [ ]:
#Create Series with Label from List
val = [86, 56,  4, 24]
label = []
mth = pd.Series(val, index=label)
mth["Andi"]

In [ ]:
#Create Series with Label from Dictionary
val = {"Andi":86, "Bambang":56, "Candra": 4,"Dido":24}
mth = pd.Series(val)
mth["Andi"]

# **04. Slicing Data**

**Basic Operation and Function**

In [ ]:
data[0:5]                  # 0:5 row

In [ ]:
data.Name                  # column of name

In [ ]:
data["Name"]               # column of name

In [ ]:
data.Name[0:5]             # 0:5 row of name

In [ ]:
data.head(5)               # 0:5 row

In [ ]:
data.tail(5)               #-6:-1 row

**\<loc> Function (Label Dependent)**

In [ ]:
data.loc[1]                # 1 row (label)

In [ ]:
data.loc[0:5]              # 0:5 row (label)

In [ ]:
data.loc[[1,3,5]]          # row 1,3, and 5 (label)

In [ ]:
data.loc[1:4,"Mth":"Chm"]  # row 1:4 and column Mth & Chm (label)

**\<iloc> Function (Index Dependent)**

In [ ]:
data.iloc[1]               # 1 row (Index)

In [ ]:
data.iloc[[1,3,5]]         # row 1,3, and 5 (Index)

In [ ]:
data.iloc[1]               # 1 row (Index)

In [ ]:
data.iloc[1:4,1:3]         # row 1:4 and column Mth & Chm (Index)

**Data Frame with Index**

In [ ]:
newData = data.copy()
newData.set_index("Name", inplace=True)
newData.loc["Andi":"Candra"]

In [ ]:
newData.index

# **05. Cleaning**

In [ ]:
#Remove Row with NaN (as return function)
cleanData = data.dropna()
cleanData

In [ ]:
#Remove Riw with NaN (as method)
cleanData = data.copy()
cleanData.dropna(inplace=True)
cleanData

In [ ]:
#Replace NaN with value
cleanData = data.copy()
cleanData.fillna(-1, inplace=True)
cleanData

In [ ]:
#Replace NaN with value at spesivic column
cleanData = data.copy()
cleanData.Chm.fillna(0, inplace=True)
cleanData

# **06. Remove Duplicate**

In [ ]:
#Remove Duplicat (Exact)
cleanData = data.copy()
cleanData.drop_duplicates(inplace=True)
cleanData

In [ ]:
#Remove Duplicat (spesific column)
cleanData = data.copy()
cleanData = cleanData[cleanData.Name.duplicated()==False]
cleanData

# **07. Filtering**

In [ ]:
localData = data.copy()
localData = localData[localData.Name.duplicated()==False]
localData.dropna(inplace=True)
localData

In [ ]:
#Logical Operatir
# >  <  >=  <=  ==  !=
newData = localData[localData.Mth >= 50]
newData

In [ ]:
#Multiple Logical Operatir
# &(and)  |(or)  ~(tilde/not)
localData[  (localData.Mth >= 50) & ~(localData.Chm >= 50)  ]

In [ ]:
# <isin> Method of Column
name = ["Andi","Bambang","Candra"]
localData[localData.Name.isin(name)==False]

In [ ]:
# <startswith> Str Accessor
localData[localData.Name.str.startswith('B')]

In [ ]:
# <contains> Str Accessor
localData[localData.Name.str.contains('a')]

In [ ]:
# <query> Function
localData.query(" Mth>50 and Phy>=70")

In [ ]:
# <nlargest> Function
localData.nlargest(3,"Mth")

In [ ]:
# <nlargest> Function
localData.nsmallest(3,"Mth")

# **08. Modifie Value**

In [40]:
localData = data.copy()
localData = localData[localData.Name.duplicated()==False]
localData.dropna(inplace=True)
localData

      Name  Mth  Phy   Chm  Bio
0     Andi   86   62  43.0   23
1  Bambang   56   75  53.0   85
2   Candra    4   75  42.0   21
3     Dido   24   52  12.0   52
7    Gandi   70   70  70.0   70

In [ ]:
#Change Value
modData = localData.copy()
for idx in modData.index:
    modData.loc[idx,"Name"] = "yo"
modData

In [ ]:
#Add New Column
modData = localData.copy()
for idx in modData.index:
    modData.loc[idx,"Avarage"] = sum(modData.loc[idx,'Mth':'Bio'])/4
modData

In [ ]:
#Convert To Numeric
localData.Mth = localData.Mth.astype('Int64')

In [ ]:
#Conver to datetime
#localData.Lahir = localData.Lahir.astype('datetime64')
#Use aksesor ".dt" to acces atribute
#    localData.loc[localData.Lahir.dt.month]

# **09. Sort-ing**

In [18]:
dataSort = data.sort_values("Chm",ascending=False)
dataSort

      Name  Mth  Phy   Chm  Bio
4     Dido   74   24  74.0   32
7    Gandi   70   70  70.0   70
1  Bambang   56   75  53.0   85
6      NaN   34   45  52.0   14
0     Andi   86   62  43.0   23
2   Candra    4   75  42.0   21
3     Dido   24   52  12.0   52
5     Erik   23   64   NaN   31

# **10. Data Propertirs**

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Mth     8 non-null      int64
 2   Phy     8 non-null      int64
 3   Chm     7 non-null      float64
 4   Bio     8 non-null      int64
dtypes: float64(1), int64(3), object(1)
memory usage: 352.0+ bytes

In [28]:
#Total data
data.size

40

In [27]:
#number of row
len(data)

8

In [26]:
#number of column
len(data.columns)

5

In [29]:
#Data Dimention
data.shape

(8, 5)

# **XX. Other**

In [5]:
data.corr()

          Mth       Phy       Chm       Bio
Mth  1.000000 -0.251704  0.559447  0.252793
Phy -0.251704  1.000000 -0.211567  0.390703
Chm  0.559447 -0.211567  1.000000  0.094181
Bio  0.252793  0.390703  0.094181  1.000000

In [6]:
data.Mth.corr( data.Phy )

-0.2517036612094818